In [3]:
import pandas as pd

df = pd.read_csv('C:\\Users\\rajat.prakash\\Desktop\\Remote_repo\\Data\\New folder\\Uber Drives 2016.csv')

In [16]:
# to check the type of each columns 
df.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [28]:
df['START_DATE*'] = pd.to_datetime(df['START_DATE*'])
df.dtypes

START_DATE*    datetime64[ns]
END_DATE*              object
CATEGORY*              object
START*                 object
STOP*                  object
MILES*                float64
PURPOSE*               object
dtype: object

In [21]:
df.tail(3)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1152,2016-12-31 15:03:00,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,2016-12-31 21:32:00,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,2016-12-31 22:08:00,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

In [23]:
df.shape

(1155, 7)

In [27]:
df.size

8085

## Revision Done Now start the today's session

### Common Data Manipulation Task

### First WE will Study about the iloc - ALso known as POsitional Indexing

In [37]:
df.head(5)
df.iloc[0:4,0:3] # rows,columns

          START_DATE*       END_DATE* CATEGORY*
0 2016-01-01 21:11:00  1/1/2016 21:17  Business
1 2016-01-02 01:25:00   1/2/2016 1:37  Business
2 2016-01-02 20:25:00  1/2/2016 20:38  Business
3 2016-01-05 17:31:00  1/5/2016 17:45  Business

In [38]:
df.iloc[0:4,[0,2,4]] # rows till 4 and only selective columns I need

          START_DATE* CATEGORY*        STOP*
0 2016-01-01 21:11:00  Business  Fort Pierce
1 2016-01-02 01:25:00  Business  Fort Pierce
2 2016-01-02 20:25:00  Business  Fort Pierce
3 2016-01-05 17:31:00  Business  Fort Pierce

### Secondly  we will Study about the loc - ALso known as Label Indexing

In [40]:
df.head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,2016-01-01 21:11:00,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,2016-01-02 01:25:00,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,2016-01-02 20:25:00,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,2016-01-05 17:31:00,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,2016-01-06 14:42:00,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [44]:
new_dataset=df.loc[:,['START_DATE*']]
print(new_dataset.shape) # since it has only 1 column 
df.shape # Original Data set does not gets affected

(1155, 1)

(1155, 7)

In [47]:
# Can Also do this
df[['START_DATE*','END_DATE*']] # this will also works fine without loc

             START_DATE*         END_DATE*
0    2016-01-01 21:11:00    1/1/2016 21:17
1    2016-01-02 01:25:00     1/2/2016 1:37
2    2016-01-02 20:25:00    1/2/2016 20:38
3    2016-01-05 17:31:00    1/5/2016 17:45
4    2016-01-06 14:42:00    1/6/2016 15:49
...                  ...               ...
1150 2016-12-31 01:07:00   12/31/2016 1:14
1151 2016-12-31 13:24:00  12/31/2016 13:42
1152 2016-12-31 15:03:00  12/31/2016 15:38
1153 2016-12-31 21:32:00  12/31/2016 21:50
1154 2016-12-31 22:08:00  12/31/2016 23:51

[1155 rows x 2 columns]

In [50]:
ser = df['START*'] # this comes out as a series (Columns called in pandas)
type(ser)
# pandas.core.series.Series

pandas.core.series.Series

In [53]:
# If you want the single column as a dataframe only then 
data = df[['START*']]
type(data)
# pandas.core.frame.DataFrame

pandas.core.frame.DataFrame